[
    {
        "name": "Parasite",
        "year": "2019",
        "country": "Korea",
        "genre":"Drama",
        "running Time":"2h 11m",
        "summary": "All unemployed, Ki-taek's family takes peculiar interest in the Parks for their livelihood until they get entangled in an expected incident.",
        "poster":"Parasite.jpg",
        "stillcut":"Parasite_stillcut.jpg",
        "url":"https://pedia.watcha.com/contents/mdRL4eL"
    }, {
        "name": "Snowpiercer",
        "year": "2013",
        "country": "Korea",
        "genre":"Action/SF/Thriller/Adventure/Drama",
        "running Time":"2h 5m",
        "summary": "In a future where a failed global-warming experiment kills off most life on the planet, a class system evolves aboard the Snowpiercer, a train that travels around the globe via a perpetual-motion engine.",
        "poster":"Snowpiercer.jpg",
        "stillcut":"Snowpiercer_stillcut.jpg",
        "url":"https://pedia.watcha.com/contents/mO02n15"
    },{
        "name": "House of Hummingbird",
        "year": "2018",
        "country": "Korea",
        "genre":"Drama",
        "running Time":"2h 19m",
        "summary": "Whatever she does, Eunhee feels like an outsider. Then her new Chinese teacher turns out to be so utterly different from everybody else. A compassionate and meticulously told narrative of a seemingly regular summer that leaves nothing unchanged.",
        "poster":"Hummingbird.jpg",
        "stillcut":"Hummingbird_stillcut.jpg",
        "url":"https://pedia.watcha.com/contents/m5DGrlR"
    },{
        "name": "Minari",
        "year": "2020",
        "country": "Korea",
        "genre":"Drama",
        "running Time":"1h 55m",
        "summary": "A Korean-American family moves to Arkansas in search of their own American Dream. With the arrival of their sly, foul-mouthed, but incredibly loving grandmother, the stability of their relationships is challenged even more in this new life in the rugg...",
        "poster":"Minari.jpg",
        "stillcut":"Minari_stillcut.jpg",
        "url":"https://pedia.watcha.com/contents/m53m90n"
    },{
        "name": "Maggie",
        "year": "2018",
        "country": "Korea",
        "genre":"Mystery/Comedy",
        "running Time":"1h 50m",
        "summary": "An x-ray capturing sexual intercourse turns a hospital upside down. Nurse Yeo Yun-young suspects it might be herself and her boyfriend. On her way to work, she worries that she might have to quit her work but worse things happen in the hospital.",
        "poster":"Maggie.jpg",
        "stillcut":"Maggie_stillcut.jpg",
        "url":"https://pedia.watcha.com/contents/mOPoG8D"
    },{
        "name": "The Man from Nowhere",
        "year": "2010",
        "country": "Korea",
        "genre": "Drama/Action/Crime ・ Korea",
        "running Time": "1h 59m",
        "summary": "His only friend called him 'the man from nowhere'... Taesik, a former special agent becomes a loner after losing his wife in a miserable accident and lives a bitter life running a pawnshop. He only has a few customers and a friend named Somi, a little girl next door. As Taesik spends more and more time with Somi, he gets attached to her. Then Somi is kidnapped by a gang, and as Taesik tries to save Somi by becoming deeply associated with the gang his mysterious past is revealed...",
        "poster": "Theman.jpg",
        "stillcut": "Theman_stillcut.jpg",
        "url": "https://pedia.watcha.com/contents/m5ZXrxO" 
    },{
        "name": "New World",
        "year": "2012",
        "country": "Korea",
        "genre": "Crime/Drama/Action",
        "running Time": "2h 14m",
        "summary": "An undercover cop has his loyalties tested when the boss of the corporate gang he's spent years infiltrating dies.",
        "poster": "Newworld.jpg",
        "stillcut": "Newworld_stillcut.jpg",
        "url": "https://pedia.watcha.com/contents/m5e8v3d"
    },{
        "name": "The Admiral: Roaring Currents",
        "year": "2014",
        "country": "Korea",
        "genre": "Periodic Drama/Action/Biography",
        "running Time": "2h 8m",
        "summary": "The film mainly follows the famous 1597 Battle of Myeongryang during the Japanese invasion of Korea (1592-1598), where the iconic Joseon admiral Yi Sun-sin managed to destroy a total of 133 Japanese warships with only 13 ships remaining in his command. The battle, which took place in the Myeongryang Strait off the southwest coast of the Korean Peninsula, is considered one of the greatest victories of Yi.",
        "poster": "Admiral.jpg",
        "stillcut": "Admiral_stillcut.jpg",
        "url": "https://pedia.watcha.com/contents/mWzM9D5" 
    },{
        "name": "Dongju: The Portrait of a Poet",
        "year": "2015",
        "country": "Korea",
        "genre": "Drama/Periodic Drama/Biography",
        "running Time": "1h 50m",
        "summary": "Based on the life and work of Koreas renowned poet, Yun Dong Ju. Dong Ju, while studying literature in Japan, was charged and detained for having participated in the Korean Independence Movement. Known to have created hundreds of poems during his time in jail where he spent the last two years of his life, Dong Ju passed away at the young age of 27. Although it has not been proven, some believe he died due to medical experiments that were performed on his living body.",
        "poster": "Dongju.jpg",
        "stillcut": "Dongju_stillcut.jpg",
        "url": "https://pedia.watcha.com/contents/mdBzQED"
    },{
        "name": "Decision to Leave",
        "year": "2021",
        "country": "Korea",
        "genre": "Romance/Drama/Mystery",
        "running Time": "2h 18m",
        "summary": "Hae-Joon, a seasoned detective, investigates the suspicious death of a man on a mountaintop. Soon, he begins to suspect Seo-rae, the deceased's wife, while being unsettled by his attraction to her.",
        "poster": "Decision.jpg",
        "stillcut": "Decision_stillcut.jpg",
        "url": "https://pedia.watcha.com/contents/m5DP0eR"
    }, {
        "name": "Set Me Free",
        "year": "2014",
        "country": "Korea",
        "genre":"Drama",
        "running Time":"1h 48m",
        "summary": "The seventeen year old 'Yeong-jae' was safely sent away to the group home 'Isaac's house'. He is old enough to leave now, but doesn't want to go back home to his irresponsible father.",
        "poster":"SetMeFree.jpg",
        "stillcut":"SetMeFree_stillcut.jpg",
        "url":"https://pedia.watcha.com/contents/m5ZXXm9"
    }, {
        "name": "The Wailing",
        "year": "2016",
        "country": "Korea",
        "genre":"Mystery",
        "running Time":"2h 36m",
        "summary": "A stranger arrives in a little village and soon after a mysterious sickness starts spreading. A policeman is drawn into the incident and is forced to solve the mystery in order to save his daughter.",
        "poster":"TheWailing.jpg",
        "stillcut":"TheWailing_stillcut.jpg",
        "url":"https://pedia.watcha.com/contents/mWLjVZD"
    }, {
        "name": "The Host",
        "year": "2006",
        "country": "Korea",
        "genre":"Thriller",
        "running Time":"1h 59m",
        "summary": "Following the dumping of gallons of toxic waste in the river, a giant mutated squid-like appears and begins attacking the populace. Gang-du's daughter Hyun-seo is snatched up by the creature; with his family to assist him, he sets off to find her.",
        "poster":"TheHost.jpg",
        "stillcut":"TheHost_stillcut.jpg",
        "url":"https://pedia.watcha.com/contents/mOPooYW"
    }, {
        "name": "Memories of Murder",
        "year": "2003",
        "country": "Korea",
        "genre":"Crime",
        "running Time":"2h 12m",
        "summary": "1986 Gyunggi Province. The body of a young woman is found brutally raped and murdered. Two months later, a series of rapes and murders commences under similar circumstances. And in a country that had never known such crimes, the dark whispers about a serial murderer grow louder. A special task force is set up in the area, with two local detectives Park Doo-Man and Jo Young-Goo joined by a detective from Seoul who requested to be assigned to the case.",
        "poster":"MemoriesofMurder.jpg",
        "stillcut":"MemoriesofMurder_stillcut.jpg",
        "url":"https://pedia.watcha.com/contents/mE5DYeW"
    }

]
